app/Http/Controllers/FrontController.php

	public function index(){


       $posts = \App\Post::orderBy('start_date', 'dsc')->with('picture')->limit(2)->get();

        //         $posts = \App\Post::paginate($this->paginate); // pagination

               $picture = \App\Picture::get();
---
select * from `pictures` where `pictures`.`post_id` in ('4', '16')
select * from `posts` order by `start_date` desc limit 2
select * from `pictures`

    public function show(int $id){

        $post = \App\Post::find($id);
        $picture = \App\Picture::find($id);
---
select * from `posts` where `posts`.`id` = '4' limit 1
select * from `pictures` where `pictures`.`id` = '4' limit 1