app/Http/Controllers/PostController.php

select * from `posts` limit 10 offset 0
select count(*) as aggregate from `posts`
---
    public function index(Post $post)
    {
        $this->authorize('index', Post::class);
        return view('back.post.index', ['posts' => $post::paginate(10)]);

select `title`, `id` from `categories`
---
    public function create()
    {
        $this->authorize('create', Post::class);
        $categories = Category::pluck('title', 'id')->all();

select * from `categories`
---
    public function edit(Post $post, Category $categories)
    {
        return view('back.post.edit', [
            'post' => $post,
            'categories' => $categories::all()
        ]);

update `posts` set `start_date` = '2019-12-18', `end_date` = '2020-09-23', `updated_at` = '2018-09-24 14:20:41' where `id` = '4'
select * from `posts` where `posts`.`id` = '4' limit 1
---
    public function update(Request $request, $id)
    {
        $post = Post::find($id);
        $post->update($request->all());
        $file = $request->file('picture');
        if(!empty($file)) {
            if(count($post->picture) > 0) {
                Storage::disk('local')->delete($post->picture->link);
                $post->picture()->delete();
            }
            $link = $request->file('picture')->store('./');
            $this->savePicture($post, $link);
        }

        $post->save();
        return redirect()->route('post.index')->with('success', 'Le livre à bien été mis à jour');

delete from `posts` where `id` = '42'
---
    public function destroy(Post $post)
    {
        $post->delete();