app/Http/Controllers/PostTypeController.php

    public function show($post_types){
    	return \App\Post::find($post_types);
---
select * from `posts` where `post_type` = 'stage'